## Indexing and Transformation

- Data Selection and Indexing in Series
    - Series as Dictionary
    - Series As Array
        - Slicing -> By Explisit or Implisit Index
        - Masking/Filtering
        - Multi Select Indexis
    - iloc -> indexing or slicing with implisit index
    - loc -> indexing or slicing with explicit index
- Data Selection and Indexing in DataFrame
    - Dictionary-Style Indexing
    - Attributes-Style Access
    - access all values only
    - loc
    - iloc
    - Masking/Filtering
- Transform
    - Dataframe apply method

### Series

In [25]:
obj_series = pd.Series([0.1, 0.4, 0.7, 1], index=['a', 'b', 'c', 'd'])

In [26]:
obj_series

a    0.1
b    0.4
c    0.7
d    1.0
dtype: float64

### Series as dictionary

In [7]:
obj_series.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
obj_series.values

array([0.1, 0.4, 0.7, 1. ])

In [9]:
'a' in obj_series

True

### Series as array

In [ ]:
- Slicing, masking, MultiSelect Index

In [ ]:
- Implicit Index
- Explicit Index

In [22]:
# slicing dengan explicit index
obj_series[1:3]

1    0.4
2    0.7
dtype: float64

In [11]:
# slicing dengan implicit index
obj_series[:3]

a    0.1
b    0.4
c    0.7
dtype: float64

In [13]:
# masking/filtering
obj_series[obj_series > 0.5]

c    0.7
d    1.0
dtype: float64

In [15]:
obj_series[['a', 'b', 'c']]

a    0.1
b    0.4
c    0.7
dtype: float64

 loc dan iloc
 
 loc itu mengakses suatu data berdasarkan explicit indexnya
 
 iloc itu mengakses suatu data berdasarkan implicit index

In [23]:
obj_series.iloc[:3]

0    0.1
1    0.4
2    0.7
dtype: float64

In [24]:
obj_series.loc[:3]

0    0.1
1    0.4
2    0.7
3    1.0
dtype: float64

## DataFrame as Dictionary

In [38]:
df = pd.DataFrame({'pop':[1, 4, 6, 8],
                  'kota':['Bandung', 'Garut', 'Jakarta', 'Solo']})

In [39]:
df

   pop     kota
0    1  Bandung
1    4    Garut
2    6  Jakarta
3    8     Solo

In [40]:
df[['pop']]

   pop
0    1
1    4
2    6
3    8

In [41]:
type(df['pop'])

pandas.core.series.Series

In [34]:
type(df[['populasi']])

pandas.core.frame.DataFrame

In [35]:
df.populasi

0    1
1    4
2    6
3    8
Name: populasi, dtype: int64

In [37]:
df['populasi'] is df.populasi

True

In [43]:
df.pop

<bound method NDFrame.pop of    pop     kota
0    1  Bandung
1    4    Garut
2    6  Jakarta
3    8     Solo>

## DataFrame as 2 Dimensinal Array

In [ ]:
- Filtering
- loc , iloc

In [44]:
df.values

array([[1, 'Bandung'],
       [4, 'Garut'],
       [6, 'Jakarta'],
       [8, 'Solo']], dtype=object)

In [53]:
df[(df['pop']>5) & (df.kota.str.endswith('a'))]

   pop     kota
2    6  Jakarta

In [54]:
df

   pop     kota
0    1  Bandung
1    4    Garut
2    6  Jakarta
3    8     Solo

In [ ]:
# iloc mengakses data dengan implicit index
# loc mengakses data dengan explicit index

In [60]:
df.iloc[1:3, 0]

1    4
2    6
Name: pop, dtype: int64

In [63]:
df.loc[1:3, ['pop', 'kota']]

   pop     kota
1    4    Garut
2    6  Jakarta
3    8     Solo

In [64]:
df.apply?

In [65]:
def kali_sejuta(x):
    return x*1000000

In [67]:
df['pop_kali_sejuta']=df['pop'].apply(kali_sejuta)

In [68]:
df

   pop     kota  pop_kali_sejuta
0    1  Bandung          1000000
1    4    Garut          4000000
2    6  Jakarta          6000000
3    8     Solo          8000000

In [ ]:
df['pop'].apply(kali_sejuta)

In [69]:
df['pop']

0    1
1    4
2    6
3    8
Name: pop, dtype: int64

In [70]:
df

   pop     kota  pop_kali_sejuta
0    1  Bandung          1000000
1    4    Garut          4000000
2    6  Jakarta          6000000
3    8     Solo          8000000

In [74]:
df[df['kota']=='Jakarta']['pop'] = 20

c:\users\lenovo\miniconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [76]:
df[df['kota']=='Jakarta']['pop']

2    6
Name: pop, dtype: int64

In [78]:
df.loc[2, ['pop']] = 20

In [79]:
df

   pop     kota  pop_kali_sejuta
0    1  Bandung          1000000
1    4    Garut          4000000
2   20  Jakarta          6000000
3    8     Solo          8000000

In [81]:
df.iloc[2, 0] = 100

In [82]:
df

   pop     kota  pop_kali_sejuta
0    1  Bandung          1000000
1    4    Garut          4000000
2  100  Jakarta          6000000
3    8     Solo          8000000

In [83]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 4806-0654

 Directory of C:\Users\LENOVO\Python Data Science\sanbercode 092020

10/06/2020  08:47 PM    <DIR>          .
10/06/2020  08:47 PM    <DIR>          ..
10/06/2020  06:43 PM    <DIR>          .ipynb_checkpoints
10/06/2020  07:21 PM             2,528 homelessness.csv
10/06/2020  08:47 PM            30,215 Live Session 7.ipynb
09/30/2020  09:04 PM            11,281 Logic Control flow and Loop.ipynb
10/05/2020  10:04 PM            30,456 Numpy Pandas.ipynb
05/08/2020  09:32 PM            24,045 pima indians dataset.csv
10/01/2020  09:22 PM            23,086 Python List dan Dictionary.ipynb
10/06/2020  07:19 PM           896,575 sales_subset.csv
10/03/2020  01:54 PM           117,956 Statistik.ipynb
09/28/2020  09:16 PM             3,983 Tugas Hari 1 (1).ipynb
09/29/2020  09:31 PM             5,466 Tugas Hari 2.ipynb
10/01/2020  09:54 PM            11,269 Tugas Hari 3.ipynb
10/01/2020  07:39 PM            13,653 Tugas Hari 4.ipynb
10/05/2020  08:46 PM            29,634 Tugas Hari 5.ipynb
09/29/2020  09:17 PM             3,229 Untitled.ipynb
              14 File(s)      1,203,376 bytes
               3 Dir(s)  62,699,114,496 bytes free

In [84]:
df_h = pd.read_csv('homelessness.csv')

In [85]:
df_h.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [90]:
df_h.describe()

       Unnamed: 0    individuals  family_members     state_pop
count   51.000000      51.000000       51.000000  5.100000e+01
mean    25.000000    7225.784314     3504.882353  6.405637e+06
std     14.866069   15991.025083     7805.411811  7.327258e+06
min      0.000000     434.000000       75.000000  5.776010e+05
25%     12.500000    1446.500000      592.000000  1.777414e+06
50%     25.000000    3082.000000     1482.000000  4.461153e+06
75%     37.500000    6781.500000     3196.000000  7.340946e+06
max     50.000000  109008.000000    52070.000000  3.946159e+07

In [98]:
lebih_dari_3jt = df_h['state_pop'] > 3000000

In [102]:
nama_state_awal_A = df_h['state'].str.startswith('A')

In [111]:
df_h.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [107]:
df_h[(nama_state_awal_A) | (lebih_dari_3jt)].head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [115]:
df_h.drop(['Unnamed: 0'], axis=1, inplace=True)

In [116]:
df_h.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

In [126]:
df_h.sort_values(['region', 'state_pop'], ascending=[True, False], inplace=True)

In [120]:
df_h.sort_values?

In [130]:
df_h.sort_index(inplace=True)

In [131]:
df_h.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

In [1]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 4806-0654

 Directory of C:\Users\LENOVO\Python Data Science\sanbercode 092020

10/06/2020  07:20 PM    <DIR>          .
10/06/2020  07:20 PM    <DIR>          ..
10/06/2020  06:43 PM    <DIR>          .ipynb_checkpoints
10/06/2020  06:57 PM             1,201 Live Session 7.ipynb
09/30/2020  09:04 PM            11,281 Logic Control flow and Loop.ipynb
10/05/2020  10:04 PM            30,456 Numpy Pandas.ipynb
05/08/2020  09:32 PM            24,045 pima indians dataset.csv
10/01/2020  09:22 PM            23,086 Python List dan Dictionary.ipynb
10/06/2020  07:19 PM           896,575 sales_subset.csv
10/03/2020  01:54 PM           117,956 Statistik.ipynb
09/28/2020  09:16 PM             3,983 Tugas Hari 1 (1).ipynb
09/29/2020  09:31 PM             5,466 Tugas Hari 2.ipynb
10/01/2020  09:54 PM            11,269 Tugas Hari 3.ipynb
10/01/2020  07:39 PM            13,653 Tugas Hari 4.ipynb
10/05/2020  08:46 PM            29,634 Tugas Hari 5.ipynb
09/29/2020  09:17 PM             3,229 Untitled.ipynb
              13 File(s)      1,171,834 bytes
               3 Dir(s)  63,579,590,656 bytes free

In [4]:
import pandas as pd